# PointLightShape Properties

---
The PointLightShape type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from LightShape)
Top
#### Reference
PointLightShape Class
Autodesk.Revit.DB.Lighting Namespace